{
  "backend/main.mo": "Motoko canister defining built‑in wallpapers and user‑specific favorites with access‑controlled add/remove/list APIs.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs for the wallpaper app.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind and OKLCH color‑token styles including light and dark theme variables.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme and toast providers.",
  "frontend/src/catalog/threeDScenes.ts": "Registry mapping scene keys to React Three Fiber components with a getter function.",
  "frontend/src/catalog/wallpaperCatalog.ts": "Defines a built‑in catalog of 2D, Live, and 3D wallpapers with metadata and asset paths.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing.",
  "frontend/src/components/favorites/FavoriteToggleButton.tsx": "Favorite toggle button handling auth, optimistic updates, and compact or full variants.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header navigation, login button, content outlet, and footer.",
  "frontend/src/components/live/LiveWallpaperPreview.tsx": "Component rendering an autoplaying live‑wallpaper video with hover play/pause control.",
  "frontend/src/components/three/scenes/AbstractOrbitScene.tsx": "Animated orbiting spheres and torus scene with dynamic positions updated each frame.",
  "frontend/src/components/three/scenes/ParticleFieldScene.tsx": "Generates and animates a rotating particle field using Points and additive blending.",
  "frontend/src/components/three/ThreeDPreviewCanvas.tsx": "Renders a 3D scene using react-three-fiber with fallback content and orbit controls, based on a scene key.",
  "frontend/src/components/three/ThreeDSnapshot.ts": "Captures the current WebGL canvas as a PNG blob for snapshot exporting.",
  "frontend/src/components/wallpapers/ApplyActions.tsx": "Provides buttons for fullscreen preview, downloading wallpapers, or exporting 3D snapshots.",
  "frontend/src/components/wallpapers/FullscreenPreviewModal.tsx": "Fullscreen modal displaying a wallpaper preview with a close button.",
  "frontend/src/components/wallpapers/WallpaperCard.tsx": "Displays a clickable wallpaper card with thumbnail, type badge, and favorite toggle.",
  "frontend/src/components/wallpapers/WallpaperPreview.tsx": "Chooses and renders the correct wallpaper preview type: 3D canvas, live video, or static image.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when changed.",
  "frontend/src/hooks/useFavoriteMutations.ts": "Provides optimistic add/remove favorite mutations synced with the backend actor.",
  "frontend/src/hooks/useFavoritesQuery.ts": "Fetches the user’s favorites list when authenticated and actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useWallpaperCatalogQuery.ts": "Loads wallpaper catalog from backend if available, falling back to built‑in wallpapers.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/screens/BrowseScreen.tsx": "Displays wallpaper catalog with type filters, loading skeletons, and error handling.",
  "frontend/src/screens/FavoritesScreen.tsx": "Shows user favorite wallpapers with authentication checks, loading states, and fallback UI.",
  "frontend/src/screens/WallpaperDetailScreen.tsx": "Renders detailed wallpaper view with preview, metadata, actions, and type-specific descriptions.",
  "frontend/src/utils/download.ts": "Provides helper functions to download files or blobs via temporary anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, including hash support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines project metadata, required images, and a list of implemented wallpaper app features for navigation, catalog, and 2D/3D/live previews. Contains no code, only structured project state and requirements."
}